/* eslint-disable jsx-a11y/control-has-associated-label */
/* eslint-disable jsx-a11y/anchor-has-content */
/* eslint-disable jsx-a11y/anchor-is-valid */
/* eslint-disable max-len */
/* eslint-disable react/no-unescaped-entities */
import React, { useReducer } from 'react';
import './requsites.css';

const initialState = {
  requsites: false,
  bankRequisites: false,
  baseDocuments: false,
  documents: false,

};

function reducer(state, action) {
  switch (action.type) {
    case 'REQUISITES':
      return { requsites: !state.requsites };
    case 'DOCUMENTS':
      return { documents: !state.documents };
    case 'BANKDOCUMENTS':
      return { bankRequisites: !state.bankDocuments };
    case 'BASEDOCUMENTS':
      return { baseDocuments: !state.baseDocuments };
    default:
      throw new Error();
  }
}

function Requsites() {
  const [state, dispatch] = useReducer(reducer, initialState);

  return (
    <div className="main-container">
      <hr />
      <div className="info-container">
        <p className="title">
          Реквизиты
        </p>
        <table className={state.requsites ? 'table_dark show' : 'table_dark close'}>
          <tr>
            <th className="firstColumn">Полное наименование организации</th>
            <th className="secondColumn">Автономная некоммерческая общеобразовательная организация "Комплексный общеобразовательный центр для детей с ДЦП "Выше Радуги"</th>
          </tr>
          <tr>
            <th className="firstColumn">Сокращенное наименование организации</th>
            <th className="secondColumn">АНОО "Комплексный общеобразовательный центр для детей с ДЦП "Выше Радуги"</th>
          </tr>
          <tr>
            <th className="firstColumn">Наименование должности руководителя</th>
            <th className="secondColumn">Директор</th>
          </tr>
          <tr>
            <th className="firstColumn">Ф.И.О. руководителя</th>
            <th className="secondColumn">Акинцева Екатерина Леонидовна</th>
          </tr>
          <tr>
            <th className="firstColumn">Юридический адрес</th>
            <th className="secondColumn">443081, Российской Федерации, Самарская область, город Самара, улица Стара Загора, дом 56, квартира 11</th>
          </tr>
          <tr>
            <th className="firstColumn">Фактический адрес</th>
            <th className="secondColumn">443066, Российской Федерации, Самарская область, город Самара, улица 22 партсъезда, дом 40а</th>
          </tr>
          <tr>
            <th className="firstColumn">Телефон</th>
            <th className="secondColumn">+7 927 787 63 89</th>
          </tr>
          <tr>
            <th className="firstColumn">ИНН/ КПП</th>
            <th className="secondColumn">6319238062/631901001</th>
          </tr>
          <tr>
            <th className="firstColumn">ОГРН</th>
            <th className="secondColumn">1196313026403</th>
          </tr>
          <tr>
            <th className="firstColumn">ОКПО</th>
            <th className="secondColumn">36802229</th>
          </tr>
          <tr>
            <th className="firstColumn">ОКВЭД</th>
            <th className="secondColumn">85.12</th>
          </tr>
        </table>
        <button className="buttonPlus" type="button" onClick={() => dispatch({ type: 'REQUISITES' })}>{state.requsites ? '-' : '+'}</button>
      </div>
      <hr />
      <div className="info-container">
        <p className="title">
          Банковкие реквизиты
        </p>
        <button type="button" className="buttonPlus">+</button>

      </div>
      <hr />
      <div className="info-container">
        <p className="title">
          Учредительные документы
        </p>
        <button type="button" className="buttonPlus" onClick={() => dispatch({ type: 'BASEDOCUMENTS' })}>{state.baseDocuments ? '-' : '+'}</button>

      </div>
      <div className={state.baseDocuments ? 'info-container show-flex' : 'info-container close'}>

        <div className="document">
          <a href="#" download>
            <svg width="61" height="70" viewBox="0 0 61 70" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
              <path fillRule="evenodd" clipRule="evenodd" d="M61 19.6875V61.25C61 63.5706 60.0819 65.7962 58.4476 67.4372C56.8134 69.0781 54.5969 70 52.2857 70H47.9286V65.625H52.2857C53.4413 65.625 54.5496 65.1641 55.3667 64.3436C56.1838 63.5231 56.6429 62.4103 56.6429 61.25V19.6875H47.9286C46.1952 19.6875 44.5328 18.9961 43.3071 17.7654C42.0814 16.5347 41.3929 14.8655 41.3929 13.125V4.375H17.4286C16.273 4.375 15.1647 4.83594 14.3476 5.65641C13.5305 6.47688 13.0714 7.58968 13.0714 8.75V48.125H8.71429V8.75C8.71429 6.42936 9.63239 4.20376 11.2666 2.56282C12.9009 0.921872 15.1174 0 17.4286 0L41.3929 0L61 19.6875ZM6.97143 51.8438H0V69.3394H3.4465V63.4681H6.94529C8.19579 63.4681 9.25893 63.2188 10.1347 62.7113C11.0192 62.1994 11.6946 61.5081 12.1521 60.6375C12.6269 59.7239 12.868 58.7061 12.8536 57.6756C12.8536 56.5819 12.6226 55.5931 12.1651 54.7137C11.7101 53.8396 11.0144 53.1152 10.1609 52.6269C9.28943 52.1019 8.23064 51.8438 6.97143 51.8438ZM9.34607 57.6756C9.36178 58.252 9.23451 58.8234 8.97571 59.3381C8.74354 59.7863 8.38214 60.1538 7.93871 60.3925C7.43149 60.6445 6.87045 60.7676 6.30479 60.7512H3.43343V54.6H6.30914C7.259 54.6 8.00407 54.8625 8.54 55.3919C9.07593 55.9256 9.34607 56.6869 9.34607 57.6756ZM14.6487 51.8438V69.3394H21.0101C22.7574 69.3394 24.2083 68.9894 25.3586 68.3025C26.5226 67.6032 27.4316 66.5463 27.9511 65.2881C28.5175 63.9756 28.8051 62.3919 28.8051 60.5456C28.8051 58.7081 28.5219 57.1419 27.9511 55.8425C27.4377 54.5988 26.5375 53.5551 25.3847 52.8675C24.2344 52.185 22.7748 51.8438 21.0058 51.8438H14.6487ZM18.0952 54.6656H20.5483C21.6289 54.6656 22.509 54.8844 23.2018 55.3306C23.9209 55.8028 24.4634 56.5015 24.7442 57.3169C25.0884 58.1963 25.2584 59.2944 25.2584 60.6113C25.2719 61.4838 25.1723 62.3545 24.9621 63.2013C24.8068 63.8691 24.5161 64.4976 24.1081 65.0475C23.729 65.5381 23.2267 65.9186 22.6528 66.15C21.9803 66.4026 21.2661 66.5244 20.5483 66.5088H18.0952V54.6656ZM34.404 62.3787V69.3394H30.9619V51.8438H42.0639V54.7006H34.404V59.5875H41.4016V62.3787H34.404Z" />
            </svg>
            <p>
              Лист записи ЕГРЮЛ
              {' '}
              {' '}
              <br />
              {' '}
              (Размер файла)

            </p>
          </a>

        </div>
        <div className="document">
          <a href="#" download>
            <svg width="61" height="70" viewBox="0 0 61 70" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
              <path fillRule="evenodd" clipRule="evenodd" d="M61 19.6875V61.25C61 63.5706 60.0819 65.7962 58.4476 67.4372C56.8134 69.0781 54.5969 70 52.2857 70H47.9286V65.625H52.2857C53.4413 65.625 54.5496 65.1641 55.3667 64.3436C56.1838 63.5231 56.6429 62.4103 56.6429 61.25V19.6875H47.9286C46.1952 19.6875 44.5328 18.9961 43.3071 17.7654C42.0814 16.5347 41.3929 14.8655 41.3929 13.125V4.375H17.4286C16.273 4.375 15.1647 4.83594 14.3476 5.65641C13.5305 6.47688 13.0714 7.58968 13.0714 8.75V48.125H8.71429V8.75C8.71429 6.42936 9.63239 4.20376 11.2666 2.56282C12.9009 0.921872 15.1174 0 17.4286 0L41.3929 0L61 19.6875ZM6.97143 51.8438H0V69.3394H3.4465V63.4681H6.94529C8.19579 63.4681 9.25893 63.2188 10.1347 62.7113C11.0192 62.1994 11.6946 61.5081 12.1521 60.6375C12.6269 59.7239 12.868 58.7061 12.8536 57.6756C12.8536 56.5819 12.6226 55.5931 12.1651 54.7137C11.7101 53.8396 11.0144 53.1152 10.1609 52.6269C9.28943 52.1019 8.23064 51.8438 6.97143 51.8438ZM9.34607 57.6756C9.36178 58.252 9.23451 58.8234 8.97571 59.3381C8.74354 59.7863 8.38214 60.1538 7.93871 60.3925C7.43149 60.6445 6.87045 60.7676 6.30479 60.7512H3.43343V54.6H6.30914C7.259 54.6 8.00407 54.8625 8.54 55.3919C9.07593 55.9256 9.34607 56.6869 9.34607 57.6756ZM14.6487 51.8438V69.3394H21.0101C22.7574 69.3394 24.2083 68.9894 25.3586 68.3025C26.5226 67.6032 27.4316 66.5463 27.9511 65.2881C28.5175 63.9756 28.8051 62.3919 28.8051 60.5456C28.8051 58.7081 28.5219 57.1419 27.9511 55.8425C27.4377 54.5988 26.5375 53.5551 25.3847 52.8675C24.2344 52.185 22.7748 51.8438 21.0058 51.8438H14.6487ZM18.0952 54.6656H20.5483C21.6289 54.6656 22.509 54.8844 23.2018 55.3306C23.9209 55.8028 24.4634 56.5015 24.7442 57.3169C25.0884 58.1963 25.2584 59.2944 25.2584 60.6113C25.2719 61.4838 25.1723 62.3545 24.9621 63.2013C24.8068 63.8691 24.5161 64.4976 24.1081 65.0475C23.729 65.5381 23.2267 65.9186 22.6528 66.15C21.9803 66.4026 21.2661 66.5244 20.5483 66.5088H18.0952V54.6656ZM34.404 62.3787V69.3394H30.9619V51.8438H42.0639V54.7006H34.404V59.5875H41.4016V62.3787H34.404Z" />
            </svg>
            <p>
              Свидетельство о регистрации в Минюсте
              {' '}
              {' '}
              <br />
              {' '}
              (Размер файла)

            </p>
          </a>
        </div>
        <div className="document">
          <a href="#" download>
            <svg width="61" height="70" viewBox="0 0 61 70" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
              <path fillRule="evenodd" clipRule="evenodd" d="M61 19.6875V61.25C61 63.5706 60.0819 65.7962 58.4476 67.4372C56.8134 69.0781 54.5969 70 52.2857 70H47.9286V65.625H52.2857C53.4413 65.625 54.5496 65.1641 55.3667 64.3436C56.1838 63.5231 56.6429 62.4103 56.6429 61.25V19.6875H47.9286C46.1952 19.6875 44.5328 18.9961 43.3071 17.7654C42.0814 16.5347 41.3929 14.8655 41.3929 13.125V4.375H17.4286C16.273 4.375 15.1647 4.83594 14.3476 5.65641C13.5305 6.47688 13.0714 7.58968 13.0714 8.75V48.125H8.71429V8.75C8.71429 6.42936 9.63239 4.20376 11.2666 2.56282C12.9009 0.921872 15.1174 0 17.4286 0L41.3929 0L61 19.6875ZM6.97143 51.8438H0V69.3394H3.4465V63.4681H6.94529C8.19579 63.4681 9.25893 63.2188 10.1347 62.7113C11.0192 62.1994 11.6946 61.5081 12.1521 60.6375C12.6269 59.7239 12.868 58.7061 12.8536 57.6756C12.8536 56.5819 12.6226 55.5931 12.1651 54.7137C11.7101 53.8396 11.0144 53.1152 10.1609 52.6269C9.28943 52.1019 8.23064 51.8438 6.97143 51.8438ZM9.34607 57.6756C9.36178 58.252 9.23451 58.8234 8.97571 59.3381C8.74354 59.7863 8.38214 60.1538 7.93871 60.3925C7.43149 60.6445 6.87045 60.7676 6.30479 60.7512H3.43343V54.6H6.30914C7.259 54.6 8.00407 54.8625 8.54 55.3919C9.07593 55.9256 9.34607 56.6869 9.34607 57.6756ZM14.6487 51.8438V69.3394H21.0101C22.7574 69.3394 24.2083 68.9894 25.3586 68.3025C26.5226 67.6032 27.4316 66.5463 27.9511 65.2881C28.5175 63.9756 28.8051 62.3919 28.8051 60.5456C28.8051 58.7081 28.5219 57.1419 27.9511 55.8425C27.4377 54.5988 26.5375 53.5551 25.3847 52.8675C24.2344 52.185 22.7748 51.8438 21.0058 51.8438H14.6487ZM18.0952 54.6656H20.5483C21.6289 54.6656 22.509 54.8844 23.2018 55.3306C23.9209 55.8028 24.4634 56.5015 24.7442 57.3169C25.0884 58.1963 25.2584 59.2944 25.2584 60.6113C25.2719 61.4838 25.1723 62.3545 24.9621 63.2013C24.8068 63.8691 24.5161 64.4976 24.1081 65.0475C23.729 65.5381 23.2267 65.9186 22.6528 66.15C21.9803 66.4026 21.2661 66.5244 20.5483 66.5088H18.0952V54.6656ZM34.404 62.3787V69.3394H30.9619V51.8438H42.0639V54.7006H34.404V59.5875H41.4016V62.3787H34.404Z" />
            </svg>
            <p>
              Устав
              {' '}
              {' '}
              <br />
              {' '}
              (Размер файла)

            </p>
          </a>
        </div>
        <div className="document">
          <a href="#" download>
            <svg width="61" height="70" viewBox="0 0 61 70" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
              <path fillRule="evenodd" clipRule="evenodd" d="M61 19.6875V61.25C61 63.5706 60.0819 65.7962 58.4476 67.4372C56.8134 69.0781 54.5969 70 52.2857 70H47.9286V65.625H52.2857C53.4413 65.625 54.5496 65.1641 55.3667 64.3436C56.1838 63.5231 56.6429 62.4103 56.6429 61.25V19.6875H47.9286C46.1952 19.6875 44.5328 18.9961 43.3071 17.7654C42.0814 16.5347 41.3929 14.8655 41.3929 13.125V4.375H17.4286C16.273 4.375 15.1647 4.83594 14.3476 5.65641C13.5305 6.47688 13.0714 7.58968 13.0714 8.75V48.125H8.71429V8.75C8.71429 6.42936 9.63239 4.20376 11.2666 2.56282C12.9009 0.921872 15.1174 0 17.4286 0L41.3929 0L61 19.6875ZM6.97143 51.8438H0V69.3394H3.4465V63.4681H6.94529C8.19579 63.4681 9.25893 63.2188 10.1347 62.7113C11.0192 62.1994 11.6946 61.5081 12.1521 60.6375C12.6269 59.7239 12.868 58.7061 12.8536 57.6756C12.8536 56.5819 12.6226 55.5931 12.1651 54.7137C11.7101 53.8396 11.0144 53.1152 10.1609 52.6269C9.28943 52.1019 8.23064 51.8438 6.97143 51.8438ZM9.34607 57.6756C9.36178 58.252 9.23451 58.8234 8.97571 59.3381C8.74354 59.7863 8.38214 60.1538 7.93871 60.3925C7.43149 60.6445 6.87045 60.7676 6.30479 60.7512H3.43343V54.6H6.30914C7.259 54.6 8.00407 54.8625 8.54 55.3919C9.07593 55.9256 9.34607 56.6869 9.34607 57.6756ZM14.6487 51.8438V69.3394H21.0101C22.7574 69.3394 24.2083 68.9894 25.3586 68.3025C26.5226 67.6032 27.4316 66.5463 27.9511 65.2881C28.5175 63.9756 28.8051 62.3919 28.8051 60.5456C28.8051 58.7081 28.5219 57.1419 27.9511 55.8425C27.4377 54.5988 26.5375 53.5551 25.3847 52.8675C24.2344 52.185 22.7748 51.8438 21.0058 51.8438H14.6487ZM18.0952 54.6656H20.5483C21.6289 54.6656 22.509 54.8844 23.2018 55.3306C23.9209 55.8028 24.4634 56.5015 24.7442 57.3169C25.0884 58.1963 25.2584 59.2944 25.2584 60.6113C25.2719 61.4838 25.1723 62.3545 24.9621 63.2013C24.8068 63.8691 24.5161 64.4976 24.1081 65.0475C23.729 65.5381 23.2267 65.9186 22.6528 66.15C21.9803 66.4026 21.2661 66.5244 20.5483 66.5088H18.0952V54.6656ZM34.404 62.3787V69.3394H30.9619V51.8438H42.0639V54.7006H34.404V59.5875H41.4016V62.3787H34.404Z" />
            </svg>
            <p>
              Свидетельство о регистрации в ИФНС
              {' '}
              <br />
              {' '}
              (Размер файла)
            </p>
            <br />

          </a>
        </div>
      </div>
      <hr />
      <div className="info-container">
        <p className="title">
          Документы
        </p>
        <button type="button" className="buttonPlus" onClick={() => dispatch({ type: 'DOCUMENTS' })}>{state.documents ? '-' : '+'}</button>

      </div>
      <hr />

    </div>

  );
}

export default Requsites;
