import React from "react";
import './info.css'
import Onas from '../onas/Onas'

export default function Info (){
    
return(<><div className="container">
    <div className="title"> Согласие на обработку персональных данных</div><div className="text"> Пользователь, оставляя заявку, оформляя подписку, комментарий, запрос на обратную связь, регистрируясь либо совершая иные действия, связанные с внесением своих персональных данных на интернет-сайте
        https://xn----8sbegedz4d3a8b6a.xn--p1ai, принимает настоящее Согласие на обработку персональных данных (далее – Согласие), размещенное по адресу
        https://xn----8sbegedz4d3a8b6a.xn--p1ai/personal-data-usage-terms/.
        <br/>
        <br/>

        Принятием Согласия является подтверждение факта согласия Пользователя со всеми пунктами Согласия. Пользователь дает свое согласие организации «Автономная некоммерческая общеобразовательная организация "Комплексный общеобразовательный центр для детей с ДЦП "Выше Радуги"», которой принадлежит сайт https://xn----8sbegedz4d3a8b6a.xn--p1ai на обработку своих персональных данных со следующими условиями:
        <br/>
        <br/>
        Пользователь дает согласие на обработку своих персональных данных, как без использования средств автоматизации, так и с их использованием.
        Согласие дается на обработку следующих персональных данных (не являющимися специальными или биометрическими):<br/>
        • фамилия, имя, отчество;<br/>
        • адрес(а) электронной почты;<br/>
        • иные данные, предоставляемые Пользователем.<br/>
        <br/>
        <br/>
        Персональные данные пользователя не являются общедоступными.
        <br/>
        <br/>
        1. Целью обработки персональных данных является предоставление полного доступа к функционалу сайта https://xn----8sbegedz4d3a8b6a.xn--p1ai.
        <br/>
        <br/>
        2. Основанием для сбора, обработки и хранения персональных данных являются:<br/>
        • Ст. 23, 24 Конституции Российской Федерации;<br/>
        • Ст. 2, 5, 6, 7, 9, 18–22 Федерального закона от 27.07.06 года №152-ФЗ<br/>
        «О персональных данных»;
        • Ст. 18 Федерального закона от 13.03.06 года № 38-ФЗ «О рекламе»;<br/>
        • Устав организации «Автономная некоммерческая общеобразовательная организация "Комплексный общеобразовательный центр для детей с ДЦП "Выше Радуги"»;<br/>
        • Политика обработки персональных данных.
        <br/>
        <br/>
        3. В ходе обработки с персональными данными будут совершены следующие действия с персональными данными: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение.
        <br/>
        <br/>
        4. Передача персональных данных, скрытых для общего просмотра, третьим лицам не осуществляется, за исключением случаев, предусмотренных законодательством Российской Федерации.
        <br/>
        <br/>
        5. Пользователь подтверждает, что указанные им персональные данные принадлежат лично ему.
        <br/>
        <br/>
        6. Персональные данные хранятся и обрабатываются до момента ликвидации организации «Автономная некоммерческая общеобразовательная организация "Комплексный общеобразовательный центр для детей с ДЦП "Выше Радуги"». Хранение персональных данных осуществляется согласно Федеральному закону №125-ФЗ «Об архивном деле в Российской Федерации» и иным нормативно правовым актам в области архивного дела и архивного хранения.
        <br/>
        <br/>
        7. Пользователь согласен на получение информационных сообщений с сайта
        https://xn----8sbegedz4d3a8b6a.xn--p1ai. Персональные данные обрабатываются до отписки Пользователя от получения информационных сообщений.
        <br/>
        <br/>
        8. Согласие может быть отозвано Пользователем либо его законным представителем, путем направления Отзыва согласия на электронную
        почту – jh.black@yandex.ru с пометкой «Отзыв согласия на обработку персональных данных». В случае отзыва Пользователем согласия на обработку персональных данных организация «Автономная некоммерческая общеобразовательная организация "Комплексный общеобразовательный центр для детей с ДЦП "Выше Радуги"» вправе продолжить обработку персональных данных без согласия Пользователя при наличии оснований, указанных в пунктах 2 - 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ «О персональных данных» от 27.07.2006 г. Удаление персональных данных влечет невозможность доступа к полной версии функционала сайта
        https://xn----8sbegedz4d3a8b6a.xn--p1ai.
        <br/>
        <br/>
        9. Настоящее Согласие является бессрочным, и действует все время до момента прекращения обработки персональных данных, указанных в п.7 и п.8 данного Согласия.
        <br/>
        <br/>
        10. Место нахождения организации «Автономная некоммерческая общеобразовательная организация "Комплексный общеобразовательный центр для детей с ДЦП "Выше Радуги"» в соответствии с учредительными документами: 443081, Российской Федерации, Самарская область, город Самара, улица Стара Загора, дом 56, квартира 11.
        <br/>
        <br/></div>
</div><div className="onas">
        <Onas /></div></>

)
}