import React from "react";
import './new.css'
import Onas from '../onas/Onas'

export default function New (){
    
return(
    <><div className="contant"><div className="stat">
        <div className="date">09.04.2022</div>
        <div className="new">
            <div className="title"> В Самаре открылся образовательный центр для детей с ДЦП «Выше радуги»</div>
            <div className="midtex">
                <div className="title1">Благодаря поддержке Фонда президентских грантов и неравнодушных самарцев дети с непростым диагнозом получили дополнительную возможность общения и развития. </div>

                <figure>
                    <img src="e.jpg" />
                    <figcaption>подпись к пикче</figcaption>
                </figure>
                <div className="text">Центр «Выше радуги» расположен на ул. 22 Партсъезда, 40а, в здании бывшего детского садика, много лет использовавшегося не по назначению. По просьбе родителей детей с ДЦП мэрия два года назад передала им пустующее здание. А финансовая помощь со стороны самарского бизнеса и простых горожан позволила восстановить инженерные коммуникации, сделать в здании необходимый ремонт и приобрести необходимое оборудование. Уже к сентябрю прошлого года первый этаж был полностью отремонтирован и оборудован специализированной мебелью, постепенно в здании начали проводиться отдельные занятия, в недавно центр заработал в полную силу.
                    <br /><br /><br />
                    Первыми посетителями Центра стали 22 ребенка с церебральным параличом школьного возраста. – Абсолютное большинство наших воспитанников задолго до пандемии находилось на самоизоляции, вдали от сверстников и общества в целом, – рассказала руководитель Центра Екатерина Акинцева журналисту
                    «КП-Самара». – Теперь в их плотном графике появились занятия по развитию двигательных и речевых способностей, помощь в освоении школьных предметов, а еще рисование, лепка, резьба по дереву и просто живое общение. Центр в самом начале своего пути, но уже есть первые положительные отзывы. Одни дети подтянулись по успеваемости, другие самостоятельно готовят уроки, третьи получили первый опыт побед и поверили в свои силы.<br /><br />

                    Проект получил поддержку Фонда президентских грантов- эти средства позволят оплачивать труд педагогов, поэтому для детей все услуги оказываются бесплатно.<br /><br />

                    Руководство центра не собирается останавливаться на достигнутом. В планах появление здесь дневного пансиона, куда дети смогут приезжать на целый день, и где будет организована комплексная системная работа по их восстановлению. Цель этих занятий – подготовить выпускников к самостоятельной жизни.</div>
                <button>Читать источник</button></div></div></div>
        <div className="pohospi">
            <div className="poho">ПОХОЖИЕ СТАТЬИ</div>
            <div className="pohocont">
                <div className="postat">
                    <img src="dkltg" />
                    <div className="date1">15.12.2021</div>
                    <div className="opis">Не чужие: кто и как помогает особенным детям</div>
                    <button>Подробнее --></button>
                    <div>ПОДУМАТЬ КААК БУДЕТ РЕАЛИЗОВАН ПОИСК ПО ПОХОЖИМ СТАТЬЯМ</div>
                </div>
            </div>
        </div>
    </div><Onas /></>
)
}